# Baekjun_Programming

# Title : 세 수
# C:\Users\jkkim\PycharmProjects\Beckjun
# -*- coding: utf-8 -*-
#
# -----------------------------------------------------------------------------------------------------------
#  08-13-5543-Programming
#
#  Author       : Jeongkyu Kim
#  E-mail       : jkkim@mme.dongguk.edu
#  Version      : 0.1
#  Rev. Date    : August. 13, 2020
#
#  First, I used to program name is PyCham
#   - Python 3.0
#   - Site url : Refer to https://www.acmicpc.net/step/1
#  
#  요구 사항 : 시간 제한 (1 초), 메모리 제한 (256 MB), 정답 비율 (46.483 %)
#  문제 : 세 정수 A, B, C가 주어진다. 이때, 두 번째로 큰 정수를 출력하는 프로그램을 작성하시오. 
#
#  입력 : 첫째 줄에 세 정수 A, B, C가 공백으로 구분되어 주어진다. (1 ≤ A, B, C ≤ 100)
#  출력 : 두 번째로 큰 정수를 출력한다.
#  예제 입력_01 : 20 30 10             
#  예제 출력_01 : 20
#
#  예제 입력_02 : 30 30 10
#  예제 출력_02 : 30
#
#  예제 입력_03 : 40 40 40
#  예제 출력_03 : 40

#
#  예제 입력_03 : 20 10 10
#  예제 출력_03 : 10
# -----------------------------------------------------------------------------------------------------------
