# Baekjun_Programming

# Title : 별 찍기 -21
# C:\Users\jkkim\PycharmProjects\Beckjun
# -*- coding: utf-8 -*-
#
# -----------------------------------------------------------------------------------------------------------
#  08-13-10996-Programming
#
#  Author       : Jeongkyu Kim
#  E-mail       : jkkim@mme.dongguk.edu
#  Version      : 0.1
#  Rev. Date    : August. 13, 2020
#
#  First, I used to program name is PyCham
#   - Python 3.0
#   - Site url : Refer to https://www.acmicpc.net/step/1
#  
#  요구 사항 : 시간 제한 (1 초), 메모리 제한 (256 MB), 정답 비율 (73.425 %)
#  문제 : 예제를 보고 규칙을 유추한 뒤에 별을 찍어 보세요.
#
#  입력 : 첫첫째 줄에 N(1 ≤ N ≤ 100)이 주어진다..
#  출력 : 첫째 줄부터 차례대로 별을 출력한다.
#  예제 입력_01 : 1   
#  예제 출력_01 : *
#
#  예제 입력_02 : 2   
#  예제 출력_02 : *
#                 *
#                *
#                 *
#
#  예제 입력_03 : 3   
#  예제 출력_03 : * *
#                 *
#                * *
#                 *
#                * *
#                 *
#
#  예제 입력_04 : 4   
#  예제 출력_04 : * *
#                 * *
#                * *
#                 * *
#                * *
#                 * *
#                * *
#                 * *
#           
# -----------------------------------------------------------------------------------------------------------
